{"class_name": "Sequential", "config": [{"class_name": "Merge", "config": {"layers": [{"class_name": "Sequential", "config": [{"class_name": "Masking", "config": {"batch_input_shape": [null, 9, 5], "trainable": true, "mask_value": -999, "name": "jet_masking", "input_dtype": "float32"}}, {"class_name": "GRU", "config": {"U_regularizer": null, "name": "jet_gru", "inner_activation": "hard_sigmoid", "go_backwards": false, "output_dim": 25, "trainable": true, "init": "glorot_uniform", "activation": "tanh", "stateful": false, "unroll": false, "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "consume_less": "cpu", "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "input_dim": 5, "input_length": null}}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "jet_dropout"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Masking", "config": {"batch_input_shape": [null, 3, 6], "trainable": true, "mask_value": -999, "name": "muon_masking", "input_dtype": "float32"}}, {"class_name": "GRU", "config": {"U_regularizer": null, "name": "muon_gru", "inner_activation": "hard_sigmoid", "go_backwards": false, "output_dim": 10, "trainable": true, "init": "glorot_uniform", "activation": "tanh", "stateful": false, "unroll": false, "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "consume_less": "cpu", "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "input_dim": 6, "input_length": null}}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "muon_dropout"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Masking", "config": {"batch_input_shape": [null, 2, 6], "trainable": true, "mask_value": -999, "name": "electron_masking", "input_dtype": "float32"}}, {"class_name": "GRU", "config": {"U_regularizer": null, "name": "electron_gru", "inner_activation": "hard_sigmoid", "go_backwards": false, "output_dim": 10, "trainable": true, "init": "glorot_uniform", "activation": "tanh", "stateful": false, "unroll": false, "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "consume_less": "cpu", "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "input_dim": 6, "input_length": null}}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "electron_dropout"}}]}, {"class_name": "Sequential", "config": [{"class_name": "Masking", "config": {"batch_input_shape": [null, 2, 5], "trainable": true, "mask_value": -999, "name": "photon_masking", "input_dtype": "float32"}}, {"class_name": "GRU", "config": {"U_regularizer": null, "name": "photon_gru", "inner_activation": "hard_sigmoid", "go_backwards": false, "output_dim": 10, "trainable": true, "init": "glorot_uniform", "activation": "tanh", "stateful": false, "unroll": false, "inner_init": "orthogonal", "dropout_U": 0.0, "dropout_W": 0.0, "consume_less": "cpu", "return_sequences": false, "b_regularizer": null, "W_regularizer": null, "input_dim": 5, "input_length": null}}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "photon_dropout"}}]}], "name": "merge_1", "concat_axis": -1, "mode_type": "raw", "dot_axes": [-1, -1], "mode": "concat", "output_shape": null, "output_shape_type": "raw"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_13", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 64}}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "dropout_10"}}, {"class_name": "Highway", "config": {"W_constraint": null, "b_constraint": null, "name": "highway_4", "transform_bias": -2, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "dropout_11"}}, {"class_name": "Highway", "config": {"W_constraint": null, "b_constraint": null, "name": "highway_5", "transform_bias": -2, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.3, "trainable": true, "name": "dropout_12"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_14", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 3}}]}