{"class_name": "Sequential", "config": [{"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_8", "output_dim": 10, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "input_dtype": "float32", "input_dim": 6, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "batch_input_shape": [null, 6]}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_6"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_9", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 20}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_7"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_10", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 30}}, {"class_name": "Dropout", "config": {"p": 0.2, "trainable": true, "name": "dropout_8"}}, {"class_name": "Highway", "config": {"W_constraint": null, "b_constraint": null, "name": "highway_3", "transform_bias": -2, "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu"}}, {"class_name": "Dropout", "config": {"p": 0.1, "trainable": true, "name": "dropout_9"}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_11", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "relu", "output_dim": 10}}, {"class_name": "MaxoutDense", "config": {"W_constraint": null, "b_constraint": null, "name": "maxoutdense_3", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "input_dim": null, "b_regularizer": null, "W_regularizer": null, "output_dim": 5, "nb_feature": 4}}, {"class_name": "Dense", "config": {"W_constraint": null, "b_constraint": null, "name": "dense_12", "activity_regularizer": null, "trainable": true, "init": "glorot_uniform", "input_dim": null, "b_regularizer": null, "W_regularizer": null, "activation": "softmax", "output_dim": 3}}]}